<?php

class Sulfat{

	function calculate(){
		
		// Dannye		
		$g_sa = $_GET['g_sa'];
		$kr = 0; // Відносний радіус пресуючого ролика
		$rp = $_GET['rp']; // радіус циліндричної контактної поверхні обичайки пресуючого ролика
		$r = $rm = $_GET['rm']; //радіус контактної поверхні матриці 
		$hb = $_GET['hb']; // шар продукту з мінімальною висотою

		//кутові координати верхньої φ_в0, рад, та нижньої φ_в1, рад, меж зони видавлювання
		$fiv_0 = $_GET['fiv_0']; // кутовa координатa верхньої межі зони видавлювання
		$fiv_1 = $_GET['fiv_1']; // кутовa координатa нижньої межі зони видавлювання

		$b = 3;  // робоча ширина кільцевої матриці, м
		$q = 10; // Кол-во роликов
		$wm = 2; // кутова швидкість кільцевої матриці щодо водила пресуючих роликів, рад / с
		$ro_v = 1770 ;// Щільність сульфату амонію

		// Відносний радіус пресуючого ролика
		$kr = $rp/$rm;

		// Vysota sloev
		$hv_0 = $rm-sqrt(($kr*$kr)*($rm*$rm)-pow(($rm*(1-$kr)-$hb),2)*pow(sin($fiv_0), 2))-($rm*(1-$kr)-$hb)*cos($fiv_0);
		$hv_1 = $rm-sqrt(($kr*$kr)*($rm*$rm)-pow(($rm*(1-$kr)-$hb),2)*pow(sin($fiv_1), 2))-($rm*(1-$kr)-$hb)*cos($fiv_1);

		echo "Hv0 = ".$hv_0."<br>";
		echo "Hv1 = ".$hv_1."<br>";

		$hv_sr = ($hv_0+$hv_1)/2;

		// Продуктивність Q, кг/с, прес-гранулятора 
		$Q = $ro_v*$q*$b*$wm*($hv_0-$hv_1)*($rm-$hv_sr);

		echo "Q = ".$Q."<br>";


	}

}